[{"id":1,"name":"Evidence asessment","description":"Evidence asessment","moduleAim":"This module aims to provide learners with the knowledge and skills needed in order to apply a structured evidence assessment methodology when assessing an application for international protection. The module builds around the different steps of the methodology.","learningOutcomes":[{"id":1,"description":"Describe the aims and principles of each step of EASO structured method of evidence assessment","type":"Knowledge","level":"6","educationalStandard":null},{"id":2,"description":"Explain the concept of a material fact according to EASO structured method of evidence assessment","type":"Knowledge","level":"6","educationalStandard":null},{"id":3,"description":"Identify material facts within an asylum claim according to EASO structured method of evidence assessment","type":"Skill","level":"6","educationalStandard":null},{"id":4,"description":"Explain the concept of evidence in an asylum claim according to EASO structured method of evidence assessment","type":"Knowledge","level":"6","educationalStandard":null},{"id":5,"description":"Describe the aim of credibility assessment step of EASO structured method of evidence assessment","type":"Knowledge","level":"6","educationalStandard":null},{"id":6,"description":"Explain all credibility indicators according to EASO structured method of evidence assessment","type":"Knowledge","level":"6","educationalStandard":null},{"id":7,"description":"Explain the concept of burden of proof in the asylum procedure and its possible shifts for the applicant and asylum authority according to EASO structured method of evidence assessment","type":"Knowledge","level":"6","educationalStandard":null},{"id":8,"description":"Explain the concept of standard of proof in the asylum procedure according to EASO structured method of evidence assessment","type":"Knowledge","level":"6","educationalStandard":null},{"id":9,"description":"Apply all credibility indicators to each material fact to decide whether to accept or reject it","type":"Skill","level":"6","educationalStandard":null},{"id":10,"description":"Explain the potential impact of the most common factors of distortion on credibility assessment of an asylum claim according to EASO structured method of evidence assessment","type":"Knowledge","level":"6","educationalStandard":null},{"id":11,"description":"Assess most common factors of distortion within an asylum claim according to EASO structured method of evidence assessment","type":"Skill","level":"6","educationalStandard":null},{"id":12,"description":"Explain benefit of the doubt principle used in the assessment of an asylum claim according to EASO structured method of evidence assessment","type":"Knowledge","level":"6","educationalStandard":null},{"id":13,"description":"Apply benefit of the doubt principle in the assessment of an asylum claim according to EASO structured method of evidence assessment","type":"Skill","level":"6","educationalStandard":null},{"id":14,"description":"Describe the aim of Risk assessment step of EASO structured method of evidence assessment","type":"Knowledge","level":"6","educationalStandard":null},{"id":15,"description":"Conduct risk assessment for an asylum claim according to EASO structured method of evidence assessment","type":"Skill","level":"6","educationalStandard":null},{"id":16,"description":"Justify in fact and in law decisions on asylum cases according to EU law in writing","type":"Responsibility & Autonomy","level":"6","educationalStandard":null},{"id":33,"description":"Identify all relevant pieces of evidence for all material facts within an asylum claim according to EASO structured method of evidence assessment","type":"Skill","level":"6","educationalStandard":null}]},{"id":2,"name":"Inclusion","description":"Inclusion","moduleAim":"This module aims for learners to identify and determine whether an applicant is in need of international protection and therefore is \"included” in a protection status. The course will focus on how to analyse an applicants case and decide if international protection should be granted and which form of international protection (refugee status or subsidiary protection) should be granted, in accordance with legal provisions.","learningOutcomes":[{"id":17,"description":"Describe each requisite of the refugee definition laid down in the Refugee Convention and the Qualification Directive (fear, well-foundedness, persecution, the nexus and the grounds, outside the count","type":"Knowledge","level":"6","educationalStandard":null},{"id":18,"description":"Qualify standard cases for international protection by analysing all requisites of the refugee definition","type":"Skill","level":"6","educationalStandard":null},{"id":19,"description":"Describe each requisite of the subsidiary protection definition in International and EU law (substantial grounds, real risk, serious harm), considering common points and differences with the refugee d","type":"Knowledge","level":"6","educationalStandard":null},{"id":20,"description":"Qualify standard cases for international protection by analysing all requisites of the subsidiary protection","type":"Skill","level":"6","educationalStandard":null}]},{"id":3,"name":"Inclusion Advanced","description":"Inclusion Advanced","moduleAim":"This module aims learners to identify and determine whether an applicant is in need of international protection and therefore is “included” in a protection status, in cases with an increased level of complexity with regards to interpreting different elements of refugee and/or subsidiary protection definition. The course will focus on the latest interpretation of the inclusion concepts by CJEU and ECHR and on the practical application of the CJEU interpretation to cases.","learningOutcomes":[{"id":21,"description":"Outline the concepts of actors of protection, effective protection, internal protection and protection provided by non-state actors","type":"Knowledge","level":"7","educationalStandard":null},{"id":22,"description":"Apply the concepts of actors of protection, effective protection, internal protection and protection provided by non-state actors","type":"Skill","level":"7","educationalStandard":null},{"id":23,"description":"Outline the notion of persecution based on cumulative grounds","type":"Knowledge","level":"7","educationalStandard":null},{"id":24,"description":"Apply the notion of persecution based on cumulative grounds","type":"Skill","level":"7","educationalStandard":null},{"id":25,"description":"Describe situations in which the existence of a social group must be established in line with the CJEUs approach","type":"Knowledge","level":"7","educationalStandard":null},{"id":26,"description":"Apply the notion of social group in line with the CJEUs approach","type":"Skill","level":"7","educationalStandard":null},{"id":27,"description":"Outline the notion of inhuman or degrading treatment or punishment and the minimum threshold for an act to qualify as ill-treatment in the light of the case-law","type":"Knowledge","level":"7","educationalStandard":null},{"id":28,"description":"Apply the notion of inhuman or degrading treatment or punishment and the minimum threshold for an act to qualify as ill-treatment in the light of the case-law","type":"Skill","level":"7","educationalStandard":null},{"id":29,"description":"Outline the CJEUs interpretation of the notion of \"indiscriminate violence\" in Article 15(c)","type":"Knowledge","level":"7","educationalStandard":null},{"id":30,"description":"Apply the CJEUs interpretation of the notion of \"indiscriminate violence\" in Article 15(c)","type":"Skill","level":"7","educationalStandard":null},{"id":31,"description":"Outline the notion of international or internal armed conflict to complex situations in the light of the CJEU case-law","type":"Knowledge","level":"7","educationalStandard":null},{"id":32,"description":"Apply the notion of international or internal armed conflict to complex situations in the light of the CJEU case-law","type":"Skill","level":"7","educationalStandard":null},{"id":34,"description":"Apply the notion of persecution based on cumulative grounds;","type":"Skill","level":"7","educationalStandard":null},{"id":35,"description":"Describe situations in which the existence of a social group must be established in line with the CJEU’s approach","type":"Knowledge","level":"7","educationalStandard":null},{"id":36,"description":"Apply the notion of social group in line with the CJEU’s approach","type":"Skill","level":"7","educationalStandard":null},{"id":37,"description":"Outline the notion of ‘inhuman or degrading treatment or punishment’ and the minimum threshold for an act to qualify as ill-treatment in the light of the case-law;","type":"Knowledge","level":"7","educationalStandard":null},{"id":38,"description":"Apply the notion of ‘inhuman or degrading treatment or punishment’ and the minimum threshold for an act to qualify as ill-treatment in the light of the case-law;","type":"Skill","level":"7","educationalStandard":null},{"id":39,"description":"Outline the CJEU’s interpretation of the notion of \"indiscriminate violence\" in Article 15(c);","type":"Knowledge","level":"7","educationalStandard":null},{"id":40,"description":"Apply the CJEU’s interpretation of the notion of \"indiscriminate violence\" in Article 15(c);","type":"Skill","level":"7","educationalStandard":null},{"id":41,"description":"Outline the notion of ‘international or internal armed conflict’ to complex situations in the light of the CJEU case-law;","type":"Knowledge","level":"7","educationalStandard":null},{"id":42,"description":"Apply the notion of ‘international or internal armed conflict’ to complex situations in the light of the CJEU case-law;","type":"Skill","level":"7","educationalStandard":null},{"id":43,"description":"Explain the structure of CJEU judgments and the CJEU’s methods of reasoning in asylum-related decisions;","type":"Knowledge","level":"7","educationalStandard":null},{"id":44,"description":"Outline acts of varied and complex natures as inhuman or degrading treatment or punishment in line with the CJEU case-law","type":"Knowledge","level":"7","educationalStandard":null},{"id":45,"description":"solve complex interpretative issues related to qualification for international protection in line with the CJEU’s method of interpretation of EU law in the absence of direct CJEU guidance;","type":"Skill","level":"7","educationalStandard":null},{"id":46,"description":"apply international treaties in assessing human rights violations, according to EU law","type":"Skill","level":"7","educationalStandard":null}]},{"id":4,"name":"Asylum Interviewing Method","description":"Asylum Interviewing Method","moduleAim":"This module aims to provide learners with knowledge and skills to conduct a personal asylum interview according to the Asylum Interview Method (AIM). The module introduces the learners to the aims of the personal interview, and the legal framework laying down the basis of the AIM. It focuses on various factors affecting the case officers and the applicant for international protection.","learningOutcomes":[{"id":47,"description":"Explain the legal requirements as set out in the EU asylum acquis for a personal asylum interview with an applicant for international protection. ","type":"Knowledge","level":"6","educationalStandard":null},{"id":48,"description":"Outline the aims of each phase of the Asylum Interview Method","type":"Knowledge","level":"6","educationalStandard":null},{"id":49,"description":"Plan a personal asylum interview with an applicant for international protection according to the AIM","type":"Skill","level":"6","educationalStandard":null},{"id":50,"description":"Prepare a personal asylum interview with an applicant for international protection according to the AIM","type":"Skill","level":"6","educationalStandard":null},{"id":51,"description":"Explain how the most common environmental factors may influence the personal asylum interview with an applicant for international protection","type":"Knowledge","level":"6","educationalStandard":null},{"id":52,"description":"Conduct a personal asylum interview with an applicant for international protection according to the AIM","type":"Skill","level":"6","educationalStandard":null},{"id":53,"description":"Document a personal asylum interview with an applicant for international protection according to the AIM","type":"Skill","level":"6","educationalStandard":null},{"id":54,"description":"Selectively employ appropriate strategies to address most common personal asylum interview related emotions and challenges prior and during the personal asylum interview  ","type":"Responsibility & Autonomy","level":"6","educationalStandard":null}]},{"id":5,"name":"Advanced Interviewing","description":"Advanced Interviewing","moduleAim":"This module aims to provide learners with knowledge and skills to conduct a non-standard interview (an interview of a higher complexity) following the Asylum Interviewing Method.  The module provides learners with tools on how to address difficult situations, which may occur during the asylum interview, following the AIM.","learningOutcomes":[{"id":55,"description":"Identify appropriate strategies to conduct a personal asylum interview of a higher complexity  using the AIM","type":"Knowledge","level":"7","educationalStandard":null},{"id":56,"description":"Outline relevant ECHR and CJEU jurisprudence on the asylum interview (questioning techniques)","type":"Knowledge","level":"7","educationalStandard":null},{"id":57,"description":"Plan and prepare a personal asylum interview of a higher complexity using the AIM.","type":"Skill","level":"7","educationalStandard":null},{"id":58,"description":"Conduct and document a personal asylum interview of a higher complexity using the AIM.","type":"Skill","level":"7","educationalStandard":null},{"id":59,"description":"Outline strategies and difficulties of the probing phase in a personal asylum interview of a higher level of complexity","type":"Knowledge","level":"7","educationalStandard":null},{"id":60,"description":"Conduct the probing phase in a personal asylum interview of a higher complexity using the AIM.","type":"Skill","level":"7","educationalStandard":null},{"id":61,"description":"Explain how specific needs influence the personal asylum interview. ","type":"Knowledge","level":"7","educationalStandard":null},{"id":62,"description":"Adapting AIM strategies to address inconsistencies during the personal asylum interview .","type":"Skill","level":"7","educationalStandard":null}]},{"id":6,"name":"Managing cases with children","description":"Managing cases with children","moduleAim":"This module aims to provide learners with knowledge and skills to conduct personal asylum interviews and assess evidence in applications for international protection submitted by children.","learningOutcomes":[{"id":63,"description":"Explain how minor age and maturity of the child influence the personal asylum interview.  ","type":"Knowledge","level":"7","educationalStandard":null},{"id":64,"description":"Explain how minor age and maturity of the child influence the evidence assessment process.","type":"Knowledge","level":"7","educationalStandard":null},{"id":65,"description":"Outline the relevant ECHR, CJEU jurisprudence related to child applicants.","type":"Knowledge","level":"7","educationalStandard":null},{"id":66,"description":"Planning the personal asylum interview with a child according to the AIM","type":"Skill","level":"7","educationalStandard":null},{"id":67,"description":"Preparing the personal asylum interview with a child according to AIM","type":"Skill","level":"7","educationalStandard":null},{"id":68,"description":"Conduct the personal asylum interview with a child according to AIM","type":"Skill","level":"7","educationalStandard":null},{"id":69,"description":"Documenting the personal asylum interview with a child according to AIM","type":"Skill","level":"7","educationalStandard":null},{"id":70,"description":"Identify material facts within an asylum claim submitted by a child applicant using EASO structured method of evidence assessment","type":"Skill","level":"7","educationalStandard":null},{"id":71,"description":"Assess statements and other evidence submitted by a child applicants, according to EASO structured method of evidence assessment.","type":"Skill","level":"7","educationalStandard":null},{"id":72,"description":"Assess potential factors of distortion in applications submitted by children according to EASO structured method of evidence assessment","type":"Skill","level":"7","educationalStandard":null},{"id":73,"description":"Apply benefit of the doubt principle in applications submitted by children according to EASO structured method of evidence assessment","type":"Skill","level":"7","educationalStandard":null},{"id":74,"description":"Conduct risk assessment in applications submitted by children according to EASO structured method of evidence assessment","type":"Skill","level":"7","educationalStandard":null}]},{"id":7,"name":"Managing SOGI cases","description":"Managing SOGI cases","moduleAim":"This module aims to provide learners with knowledge and skills to conduct personal asylum interviews and assess evidence in applications for international protection based on gender, gender identity and sexual orientation.","learningOutcomes":[{"id":75,"description":"Explain how SOGI, norms and norm systems and non-conformity to norms (norms circle) influence the personal asylum interview of the SOGI applicants","type":"Knowledge","level":"7","educationalStandard":null},{"id":76,"description":"Explain how norms and norm systems and non-conformity to norms (norms circle) influence the evidence assessment process for the SOGI applicants","type":"Knowledge","level":"7","educationalStandard":null},{"id":77,"description":"Outline the relevant ECHR, CJEU related to SOGI","type":"Knowledge","level":"7","educationalStandard":null},{"id":78,"description":"Planning the personal asylum interview with SOGI applicants according to the AIM","type":"Skill","level":"7","educationalStandard":null},{"id":79,"description":"Preparing the personal asylum interview with SOGI applicants according to the AIM","type":"Skill","level":"7","educationalStandard":null},{"id":80,"description":"Conduct the personal asylum interview with SOGI applicants according to the AIM","type":"Skill","level":"7","educationalStandard":null},{"id":81,"description":"Documenting the personal asylum interview with SOGI applicants according to the AIM","type":"Skill","level":"7","educationalStandard":null},{"id":82,"description":"Identify material facts in an asylum claim submitted by SOGI applicants using EASO structured method of evidence assessment","type":"Skill","level":"7","educationalStandard":null},{"id":83,"description":"Assess statements and other evidence submitted by SOGI applicants according to EASO structured method of evidence assessment.","type":"Skill","level":"7","educationalStandard":null},{"id":84,"description":"Assess potential factors of distortion in applications submitted by SOGI applicants according to EASO structured method of evidence assessment","type":"Skill","level":"7","educationalStandard":null},{"id":85,"description":"Apply benefit of the doubt principle in applications submitted by SOGI applicants according to EASO structured method of evidence assessment","type":"Skill","level":"7","educationalStandard":null},{"id":86,"description":"Conduct risk assessment in applications submitted by SOGI applicants according to EASO structured method of evidence assessment","type":"Skill","level":"7","educationalStandard":null}]},{"id":8,"name":"Managing THB cases","description":"Managing THB cases","moduleAim":"This module aims to provide learners with knowledge and skills to conduct personal asylum interviews and assess evidence in applications for international protection submitted by potential THB victims.","learningOutcomes":[{"id":87,"description":"Explain potential implications of THB on each phase of the Asylum Interviewing Method.","type":"Knowledge","level":"7","educationalStandard":null},{"id":88,"description":"Explain potential implications of THB on the structured method evidence assessment process.","type":"Knowledge","level":"7","educationalStandard":null},{"id":89,"description":"Outline the relevant ECHR, CJEU jurisprudence related to applicants potential victims of THB.","type":"Knowledge","level":"7","educationalStandard":null},{"id":90,"description":"Plan the personal asylum interview with applicants potential victims of THB according to the Asylum Interview Method","type":"Skill","level":"7","educationalStandard":null},{"id":91,"description":"Prepare for the personal asylum interview with applicants potential victims of THB according to the Asylum Interview Method","type":"Skill","level":"7","educationalStandard":null},{"id":92,"description":"Conduct the personal asylum interview with applicants potential victims of THB according to the Asylum Interview Method","type":"Skill","level":"7","educationalStandard":null},{"id":93,"description":"Document the personal asylum interview with applicants potential victims of THB according to the Asylum Interview Method","type":"Skill","level":"7","educationalStandard":null},{"id":94,"description":"Identify material facts in asylum claims submitted by an applicant potential victims of THB using EASO structured method of evidence assessment","type":"Skill","level":"7","educationalStandard":null},{"id":95,"description":"Assess statements and other evidence submitted by applicants potential victims of THB according to EASO structured method of evidence assessment.","type":"Skill","level":"7","educationalStandard":null},{"id":96,"description":"Assess potential factors of distortion in asylum claims submitted by applicants potential victims of THB according to EASO structured method of evidence assessment","type":"Skill","level":"7","educationalStandard":null},{"id":97,"description":"Apply benefit of the doubt principle in asylum claims submitted by applicants potential victims of THB according to EASO structured method of evidence assessment","type":"Skill","level":"7","educationalStandard":null},{"id":98,"description":"Conduct risk assessment in asylum claims submitted by applicants potential victims of THB according to EASO structured method of evidence assessment","type":"Skill","level":"7","educationalStandard":null}]}]